#ifndef MA_CFG_H_
#define MA_CFG_H_

//=============================================================================
// размер 1 страницы в байтах, минимальный объем пам€ти выдел€емый при запросе
#define MA_PAGE_SIZE   (4096)

//=============================================================================
// количество страниц, Ё“ќ максимальное значени€ дл€ 16 бит т.к. 
// в typedef struct heap_alloc_mcb
// номера указывающие на след. и пред. записи 16 битные !!!
// 65536 * 4096 = 256 ћ√б
#define MA_PAGE_NUMBER (16)//(65536)

#endif